package homework.lesson1;

public class Main6 {
    public static void main(String[] args) {
        //Задача: напечатать цифры от 90 до 100 в обратном порядке
        for (int i = 100; i >= 90; i--) {
            System.out.println(i);
        }
    }
}

