package homework.lesson1;

public class Main2 {
    public static void main(String[] args) {
        //Задача: с помощью FOR  напечатать цифры от 0 до -20
        //int i=0 начальная цифра отсчета
        // i>-21 пока True выполнять следующее действие
        // i=--i переменную i уменьшить на единицу
        for (int i = 0; i >= -20; i--) {
            System.out.println(i);
        }

    }
}
